Autodesk.Revit.DB.StructuralAsset.SetThermalExpansionCoefficient(System.Double)
Sets the thermal expansion coefficient of the asset.
Remarks:
The thermal expansion coefficient is one-dimensional for wood-based and isotropic materials.
This method sets the x, y, and z components to the same value.
The value is in inverse Kelvin (1/K).
Since:
2013

Autodesk.Revit.DB.StructuralAsset.SetShearModulus(System.Double)
Sets the shear modulus of the asset.
Remarks:
The shear modulus is one-dimensional for wood-based and isotropic materials.
This method sets the x, y, and z components to the same value.
The value is in Newtons per foot meter (N/(ft · m)).
Since:
2013

Autodesk.Revit.DB.StructuralAsset.SetPoissonRatio(System.Double)
Sets the Poisson ratio of the asset.
Remarks:
The Poisson ratio is one-dimensional for wood-based and isotropic materials.
This method sets the x, y, and z components to the same value.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.SetYoungModulus(System.Double)
Sets the Young's modulus of the asset.
Remarks:
The Young's modulus is one-dimensional for wood-based and isotropic materials.
This method sets the x, y, and z components to the same value.
The value is in Newtons per foot meter (N/(ft · m)).
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Equals(Autodesk.Revit.DB.StructuralAsset)
Determines whether this structural asset is equal to another.
other:
The structural asset with which to compare this structural asset.
Returns:
True if the given structural asset is equal to this one, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Copy
Produces a copy of the asset.
Returns:
A copy of the asset.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.StructuralAsset.Name
The name of the structural asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Density
The density of the asset.
Remarks:
Values are in kilograms per cubed feet (kg/ft³) and must be non-negative.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for density must be non-negative.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.SubClass
The sub-class of the asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodGrade
The grade of wood used in a wood-based asset.
Remarks:
Applies to wood-based structural assets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodSpecies
The species of wood used in a wood-based asset.
Remarks:
Applies to wood-based structural assets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodPerpendicularShearStrength
The perpendicular shear strength of the asset.
Remarks:
Applies to wood-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodParallelShearStrength
The parallel shear strength of the asset.
Remarks:
Applies to wood-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodPerpendicularCompressionStrength
The perpendicular compression strength of the asset.
Remarks:
Applies to wood-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodParallelCompressionStrength
The parallel compression strength of the asset.
Remarks:
Applies to wood-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.WoodBendingStrength
The bending strength of the asset.
Remarks:
Applies to wood-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be wood to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.MetalResistanceCalculationStrength
The resistance calculation strength of the asset.
Remarks:
Applies to metal-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be Metal to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.MetalReductionFactor
The reduction factor of the asset.
Remarks:
Applies to Metal-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be Metal to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.MinimumTensileStrength
The minimum tensile strength of the asset.
Remarks:
Applies to Metal-based and generic structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be Metal or generic to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.MinimumYieldStress
The minimum yield stress of the asset.
Remarks:
Applies to Metal-based and generic structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be Metal or generic to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ConcreteShearStrengthReduction
The shear strength reduction of the asset.
Remarks:
Applies to concrete-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be concrete to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ConcreteShearReinforcement
The shear reinforcement of the asset.
Remarks:
Applies to concrete-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be concrete to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ConcreteBendingReinforcement
The bending reinforcement of the asset.
Remarks:
Applies to concrete-based structural assets.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be concrete to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ConcreteCompression
The compression strength of concrete-based assets.
Remarks:
Applies to concrete-based structural assets.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type must be concrete to set this property.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Behavior
Flag indicating whether elements of this material behave isotropically or orthotropically.
Remarks:
Applies to concrete, Metal, and generic structural assets.
If the behavior is set to Isotropic, then the y and z components of Young modulus,
Poisson modulus, shear modulus and thermal expansion coefficient will be changed to
the value the same as their x components.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.StructuralAsset.Lightweight
Flag indicating whether the asset describes a material that is light-weight or not.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.DampingRatio
The damping ratio of the asset.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ThermalExpansionCoefficient
The thermal expansion coefficient of the asset.
Remarks:
This property cannot be used to set the thermal expansion coefficient for wood-based and isotropic materials.
For such assets, use setThermalExpansionCoefficient instead.
The value is in inverse Kelvin (1/K).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.ShearModulus
The shear modulus of the asset.
Remarks:
This property cannot be used to set the shear modulus for wood-based and isotropic materials.
For such assets, use setShearModulus instead.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.PoissonRatio
The Poisson ratio of the asset.
Remarks:
This property cannot be used to set the Poisson ratio for wood-based and isotropic materials.
For such assets, use setPoissonRatio instead.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.YoungModulus
The Young's modulus of the asset.
Remarks:
This property cannot be used to set the Young's modulus for wood-based and isotropic materials.
For such assets, use setYoungModulus instead.
The value is in Newtons per foot meter (N/(ft · m)).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: the material type is wood.
-or-
When setting this property: the behavior is isotropic.
Since:
2013

Autodesk.Revit.DB.StructuralAsset.StructuralAssetClass
The type of material that this structural asset describes (e.g. wood, concrete, metal.)
Since:
2013

Autodesk.Revit.DB.StructuralAsset.#ctor(System.String,Autodesk.Revit.DB.StructuralAssetClass)
Constructs an instance of StructuralAsset.
name:
The name of the asset.
structuralAssetClass:
The type of structural material that this asset will describe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.StructuralAsset
Represents the properties of a material pertinent to structural analysis.
Since:
2013